# 1  принимает 1 аргумент, начало идёт от 0 до 1 аргумента не включая его
for i in range(5):
    print(i)
# 2 принимает 2 аргумента, начало идёт от 1 аргумента до второго не включая его
for i in range(1,5):
    print(i)

#||||||||||||||примеp|||||||||||эти 2 цикла сделают одно и тоже
for i in range(5):
    print(i)
for i in range(0,5):
    print(i)
# 2 принимает 3 аргумента, начало идёт от 1 аргумента до второго не включая его
# при этом идёт пошагово
for i in range(1,5,2):
    print(i)#выведет только 1 и 3 так как шаг у нас по 2 числа, а число 5 не входит